Autodesk.Revit.DB.RevitLinkOperations.SetGetLocalPathForOpenCallback(Autodesk.Revit.DB.IGetLocalPathForOpenCallback)
Sets the IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command for Revit links
obtained from an IExternalResourceServer.
makeLocalCopyForOpen:
The IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015